САС_Центр/src/InformationRegisters/Инциденты/Инциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Инциденты</name>
  <resources>
    <name>Хэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

САС_Центр/src/HTTPServices/sas/Module.bsl
#Область ОбработчикиСобытий

// Обрабатывает запрос информации об ошибке от клиента
// Параметры:
//  Запрос - HTTPСервисЗапрос - запрос от клиента с данными об ошибке
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ с информацией о статусе обработки ошибки
//
Функция GetInfo(Запрос)

	ОтветСтрокой = Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
	ТекОшибка = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	//TODO хэш приложения теперь не прилетает, хз почему. Файловый вариант исключил.
	//Разобрался, но теперь надо понять как быть, если у клиента есть расширение
	ХэшПриложения = САС_ОбщегоНазначенияСервер.ЗначениеСвойстваJSON(ТекОшибка,"appStackHash");
	ИдКлиента	  = ТекОшибка.clientID;
	//ХэшОшибки = ТекОшибка.configHash + "-" + ТекОшибка.clientStackHash;
	
	Если ХэшПриложения <> Неопределено Тогда
		ХэшОшибки = ТекОшибка.configHash + "-" + ТекОшибка.clientStackHash + "-" + ХэшПриложения;
	КонецЕсли;
	
	ТекущаяЗадача = САС_ОбщегоНазначенияСервер.НайтиЗадачу(ХэшОшибки, ИдКлиента);
	Если ТекущаяЗадача = Неопределено Тогда
		// Это первый вызов
		//Если ХэшПриложения <> Неопределено Тогда
		НоваяЗапись = РегистрыСведений.Инциденты.СоздатьМенеджерЗаписи();
		НоваяЗапись.Хэш =   ХэшОшибки;
		НоваяЗапись.ИдКлиента = ИдКлиента;
		НоваяЗапись.Записать();
		//КонецЕсли; 
		ДанныеОтвета = Новый Структура;
		ДанныеОтвета.Вставить("needSendReport", Истина); 
		ДанныеОтвета.Вставить("userMessage", "Отчет об ошибке получен. Мы исправим ошибку быстро как только сможем.");
		ДанныеОтвета.Вставить("dumpType", 1);
	ИначеЕсли ТекущаяЗадача.Пустая() Тогда  
		// Ошибка зарегистрирована, но Задача еще не создана
		ДанныеОтвета = Новый Структура;
		ДанныеОтвета.Вставить("needSendReport", Ложь); 
		ДанныеОтвета.Вставить("userMessage", "Данная ошибка уже зарегистрирована и обрабатывается.");
		ДанныеОтвета.Вставить("dumpType", 0);
	Иначе 
		// Есть задача для ошибки
		ДанныеОтвета = Новый Структура;
		ДанныеОтвета.Вставить("needSendReport", Ложь); 
		ДанныеОтвета.Вставить("userMessage", "Данная ошибка уже зарегистрирована. Номер задачи #" + ТекущаяЗадача.Код);
		ДанныеОтвета.Вставить("dumpType", 0);
	КонецЕсли; 
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);			
	
	ДанныеОтветаСтрокой = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ДанныеОтветаСтрокой);
	
	Возврат Ответ;
	
КонецФункции

// Обрабатывает загрузку дампа ошибки от клиента
// Параметры:
//  Запрос - HTTPСервисЗапрос - запрос с двоичными данными дампа
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ с кодом 200
//
Функция PushReport(Запрос)
	
	ДанныеОтчета = Запрос.ПолучитьТелоКакДвоичныеДанные();
	
	САС_ОбщегоНазначенияСервер.ОбработатьДамп(ДанныеОтчета);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
